# 1. Площадь прямоугольного треугольника:
# Пользователь вводит длины катетов прямоугольного треугольника, а программа вычисляет и выводит его площадь.

number1 = int(input("Введите длину первого катета:"))
number2 = int(input("Введите длину второго катета:"))

summa = number1*number2//2

print("Плошадь треугольника равна:", summa)